Autodesk.Revit.DB.SpecTypeId.Reference.Material
Material, in discipline Common.

Autodesk.Revit.DB.SpecTypeId.Reference.LoadClassification
Load Classification, in discipline Electrical.

Autodesk.Revit.DB.SpecTypeId.Reference.Image
Image, in discipline Common.

Autodesk.Revit.DB.SpecTypeId.Reference.FillPattern
Fill Pattern, in discipline Common.

Autodesk.Revit.DB.SpecTypeId.Reference
This class contains constants identifying reference specs.
Since:
2021